src/Documents/инкБольничныйЛист/инкБольничныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкБольничныйЛист</name>
  <registerRecords>InformationRegister.инкРеестрБольничныхЛистов</registerRecords>
  <attributes>
    <name>БольничныйДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БольничныйДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БольничныйЛистДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БольничныйЛистНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПособия</name>
    <type>
      <types>EnumRef.инкВидыПособий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПособияЗаСчетРаботодателя</name>
    <type>
      <types>EnumRef.инкВидыПособий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейЗаСчетРаботодателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПояснениеРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетМрот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РасчетныеДанные</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейЧасовНорма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейЧасовФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейЧасовИсключение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииКвартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремииМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зарплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатРасчета</name>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.инкНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/инкРеестрБольничныхЛистов/инкРеестрБольничныхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкРеестрБольничныхЛистов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БольничныйДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БольничныйДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидПособия</name>
    <type>
      <types>EnumRef.инкВидыПособий</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>БольничныйЛист</name>
    <type>
      <types>DocumentRef.инкБольничныйЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/инкБольничныйЛист/ManagerModule.bsl
#Область о //Дополнительные процедуры и функции:

// Функция - Получить перечень больничных листов
//
// Параметры:
//  Параметры	 - структура - Параметры для запроса 
// 
// Возвращаемое значение:
//   - массив значений - массив ссылок документа "Больничный лист".
//
Функция ПолучитьПереченьБольничныхЛистов(Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкРеестрБольничныхЛистов.Регистратор КАК Регистратор,
		|	инкРеестрБольничныхЛистов.Сотрудник КАК Сотрудник,
		|	инкРеестрБольничныхЛистов.МесяцНачисления КАК МесяцНачисления,
		|	СУММА(инкРеестрБольничныхЛистов.Сумма) КАК Сумма
		|ИЗ
		|	РегистрСведений.инкРеестрБольничныхЛистов КАК инкРеестрБольничныхЛистов
		|ГДЕ
		|	инкРеестрБольничныхЛистов.Сотрудник = &Сотрудник
		|	И инкРеестрБольничныхЛистов.МесяцНачисления = &МесяцНачисления
		|
		|СГРУППИРОВАТЬ ПО
		|	инкРеестрБольничныхЛистов.Регистратор,
		|	инкРеестрБольничныхЛистов.Сотрудник,
		|	инкРеестрБольничныхЛистов.МесяцНачисления";
	
	Запрос.УстановитьПараметр("МесяцНачисления", Параметры.МесяцНачисления);
	Запрос.УстановитьПараметр("Сотрудник", Параметры.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	Возврат РезультатЗапроса;	
	
КонецФункции

#КонецОбласти	 

#Область о //Печать: 

#Область о //Больничный лист (результат расчета):

Функция СформироватьБольничныйЛистРезультатРасчетаТабличныйДокумент(БольничныйЛистОбъект) Экспорт
	
	БольничныйЛистТабличныйДокумент = Новый ТабличныйДокумент;
	БольничныйЛистМакет = ПолучитьМакет("МакетБольничныйЛистРезультатРасчета");
	
	// ЗаголовокБольничногоЛиста:
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("ЗаголовокБольничногоЛиста");
	ЗаголовокТекст = БольничныйЛистОбъект.Сотрудник.ФИОСокращенное  
				   + " - б/лист  № " + БольничныйЛистОбъект.БольничныйЛистНомер    
				   + " с " + Формат(БольничныйЛистОбъект.БольничныйДатаНачала,"ДФ=dd.MM.yyyy") 
				   + " по " + Формат(БольничныйЛистОбъект.БольничныйДатаОкончания,"ДФ=dd.MM.yyyy")
				   + " за " + Формат(БольничныйЛистОбъект.МесяцНачисления,"ДФ='ММММ гггг'") + " г.";
	ОбластьМакета.Параметры.ЗаголовокБольничногоЛиста = ЗаголовокТекст;
	БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);
	
	// ДанныеСотрудника:
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("ДанныеСотрудника");
	ДанныеСотрудникаТекст = "ИНН: " + БольничныйЛистОбъект.Сотрудник.ИНН
	 					  + " СНИЛС: " + БольничныйЛистОбъект.Сотрудник.СНИЛС;	
	ОбластьМакета.Параметры.ДанныеСотрудника = ДанныеСотрудникаТекст;
	БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);
	
	// Отступ:
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("Отступ");
	БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);

	// Расчетные данные:
	ПечатьРасчетныхДанных(БольничныйЛистТабличныйДокумент,БольничныйЛистМакет,БольничныйЛистОбъект);
	
	// Отступ:
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("Отступ");
	БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);
	
	// ПояснениеРасчета:
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("ПояснениеРасчета");
	ОбластьМакета.Параметры.ПояснениеРасчета = БольничныйЛистОбъект.ПояснениеРасчета;
	БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);
	
	БольничныйЛистТабличныйДокумент.ПолеСверху = 2;
	БольничныйЛистТабличныйДокумент.ПолеСнизу  = 2;
	БольничныйЛистТабличныйДокумент.ПолеСлева  = 23;
	БольничныйЛистТабличныйДокумент.ПолеСправа = 2;
	БольничныйЛистТабличныйДокумент.РазмерКолонтитулаСверху	= 2;
	БольничныйЛистТабличныйДокумент.РазмерКолонтитулаСнизу	= 2;
	БольничныйЛистТабличныйДокумент.МасштабПечати = 100;
    
	Возврат БольничныйЛистТабличныйДокумент;
	
КонецФункции

Процедура ПечатьРасчетныхДанных(БольничныйЛистТабличныйДокумент,БольничныйЛистМакет,БольничныйЛистОбъект);

	// РасчетныеДанныеЗаголовок:
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеЗаголовок|РасчетныеДанныеТаблица");
	БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);                                         
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеЗаголовок|РасчетныеДанныеРазделитель");
	БольничныйЛистТабличныйДокумент.Присоединить(ОбластьМакета);                                         
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеЗаголовок|РасчетныеДанныеТаблица");
	БольничныйЛистТабличныйДокумент.Присоединить(ОбластьМакета);                                         
	
	ПериодДата1 = НачалоГода(ДобавитьМесяц(БольничныйЛистОбъект.МесяцНачисления,-24));
	ПериодДата2 = НачалоГода(ДобавитьМесяц(БольничныйЛистОбъект.МесяцНачисления,-12));
	Для МесяцЧисло = 1 По 12 Цикл
		
		ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеСтрока|РасчетныеДанныеТаблица");
		ЗаполнитьДанныеОбластиПоПериодуМесяц(ПериодДата1,БольничныйЛистОбъект.РасчетныеДанные,ОбластьМакета);
		БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеСтрока|РасчетныеДанныеРазделитель");
		БольничныйЛистТабличныйДокумент.Присоединить(ОбластьМакета);                                         
		
		ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеСтрока|РасчетныеДанныеТаблица");
		ЗаполнитьДанныеОбластиПоПериодуМесяц(ПериодДата2,БольничныйЛистОбъект.РасчетныеДанные,ОбластьМакета);
		БольничныйЛистТабличныйДокумент.Присоединить(ОбластьМакета);
		
		ПериодДата1 = ДобавитьМесяц(ПериодДата1,1);
		ПериодДата2 = ДобавитьМесяц(ПериодДата2,1);

	КонецЦикла;
	
	// РасчетныеДанныеИтоги:        
	ПериодДата1 = НачалоГода(ДобавитьМесяц(БольничныйЛистОбъект.МесяцНачисления,-24));
	ПериодДата2 = НачалоГода(ДобавитьМесяц(БольничныйЛистОбъект.МесяцНачисления,-12));

	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеИтоги|РасчетныеДанныеТаблица");
	ЗаполнитьДанныеОбластиПоПериоду(ПериодДата1,БольничныйЛистОбъект.РасчетныеДанные,ОбластьМакета);
	БольничныйЛистТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеИтоги|РасчетныеДанныеРазделитель");
	БольничныйЛистТабличныйДокумент.Присоединить(ОбластьМакета);                                         
	
	ОбластьМакета = БольничныйЛистМакет.ПолучитьОбласть("РасчетныеДанныеИтоги|РасчетныеДанныеТаблица");
	ЗаполнитьДанныеОбластиПоПериоду(ПериодДата2,БольничныйЛистОбъект.РасчетныеДанные,ОбластьМакета);
	БольничныйЛистТабличныйДокумент.Присоединить(ОбластьМакета);

КонецПроцедуры                                

Процедура ЗаполнитьДанныеОбластиПоПериоду(ПериодДата,РасчетныеДанные,ОбластьМакета)
	
	РасчетныеДанныеСвод = РасчетныеДанные.Выгрузить().Скопировать();
	РасчетныеДанныеСвод.Очистить();

	ГодЧисло = Год(ПериодДата);
	Для каждого РасчетныеДанныеСтрока Из РасчетныеДанные Цикл
		
		Если РасчетныеДанныеСтрока.Год = ГодЧисло Тогда
			РасчетныеДанныеСводСтрока = РасчетныеДанныеСвод.Добавить();
			ЗаполнитьЗначенияСвойств(РасчетныеДанныеСводСтрока,РасчетныеДанныеСтрока);
		КонецЕсли;
		
	КонецЦикла;     
	
	РасчетныеДанныеСвод.Свернуть("Год","КоличествоДнейЧасовНорма,КоличествоДнейЧасовФакт,Зарплата,Итого");
	Для каждого РасчетныеДанныеСтрока Из РасчетныеДанныеСвод Цикл
  		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,РасчетныеДанныеСтрока);
	КонецЦикла;     
	
КонецПроцедуры

Процедура ЗаполнитьДанныеОбластиПоПериодуМесяц(ПериодДата,РасчетныеДанные,ОбластьМакета)
	
	ПоискСтруктура = Новый Структура("Месяц",ПериодДата);
	РасчетныеДанныеМассив = РасчетныеДанные.НайтиСтроки(ПоискСтруктура);
	Для каждого РасчетныеДанныеЭлемент Из РасчетныеДанныеМассив Цикл             	
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,РасчетныеДанныеЭлемент); 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
